tap "cloudflare/cloudflare"

# Core
brew "git"
brew "gh"
brew "jq"
brew "tree"
brew "wget"
brew "fd"
brew "ripgrep"
brew "bat"
brew "eza"
brew "fzf"
brew "zoxide"
brew "direnv"

# Shell
brew "sheldon"
brew "starship"
brew "zsh-completions"
brew "zellij"

# Editor
brew "neovim"

# Git
brew "tig"
brew "jj"

# Dev tools
brew "mise"
brew "uv"
brew "chezmoi"
brew "rustup"
brew "wasm-pack"
brew "cargo-watch"

# Infra
brew "cloudflared"

# Cask
cask "chatgpt"
cask "codex-app"
cask "cursor"
cask "discord"
cask "elgato-wave-link"
cask "figma"
cask "ghostty"
cask "google-chrome"
cask "karabiner-elements"
cask "nani"
cask "notion"
cask "obs"
cask "raycast"
cask "slack"
cask "zed"
cask "zen"

# Cursor extensions
vscode "astro-build.astro-vscode"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "drcika.apc-extension"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "humao.rest-client"
vscode "jock.svg"
vscode "mhutchie.git-graph"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.sublime-keybindings"
vscode "oxc.oxc-vscode"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "serayuzgur.crates"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "typescriptteam.native-preview"
vscode "unifiedjs.vscode-mdx"
vscode "wmaurer.change-case"
